Repository: eli-justice/jenkins-lab
Catalog: src/Egapay.Customer.Business.Gateway.Common/Resources/ErrorMessages.*.resx
Languages: fr

# GetCountriesFailed
source: failed to get countries.
fr: échec de la récupération des pays.

# GetRegionsFailed
source: failed to get regions.
fr: échec de la récupération des régions.

source: unknown country filter
fr: filtre de pays inconnu

# DefaultError
source: failed to process request. try again later.
fr: échec du traitement de la demande. veuillez réessayer plus tard.

# SendOTPFailed
source: failed to send otp. try again later.
fr: échec de l'envoi de l'OTP. veuillez réessayer plus tard.

# VerifyOTPFailed
source: failed to verify otp. try again later.
fr: échec de la vérification de l'OTP. veuillez réessayer plus tard.

# ExpiredOtp
source: The OTP has expired. Please request for a new one
fr: L'OTP a expiré. Veuillez en demander un nouveau

# NonOperatingCountry
source: The selected country is invalid for this operation
fr: Le pays sélectionné n'est pas valide pour cette opération

# InvalidCredentials
source: Login failed. The email or password you entered is incorrect. Please try again
fr: Échec de la connexion. L'email ou le mot de passe que vous avez saisi est incorrect. Veuillez réessayer

# MerchantNotFound
source: merchant does not exist
fr: le commerçant n'existe pas

# RequestPasswordResetFailed
source: failed to request password reset. try again later.
fr: échec de la demande de réinitialisation du mot de passe. veuillez réessayer plus tard.

# AuthenticateMerchantFailed
source: failed to authenticate merchant. try again later.
fr: échec de l'authentification du commerçant. veuillez réessayer plus tard.

# ResetPasswordFailed
source: failed to reset password. try again later.
fr: échec de la réinitialisation du mot de passe. veuillez réessayer plus tard.

source: unauthorized user
fr: utilisateur non autorisé

# GetMerchantBusinessInfoFailed
source: failed to retrieve merchant business information. try again later.
fr: échec de la récupération des informations commerciales du commerçant. veuillez réessayer plus tard.

# GetMerchantBusinessContactInfoFailed
source: failed to retrieve merchant contact information. try again later.
fr: échec de la récupération des informations de contact du commerçant. veuillez réessayer plus tard.

# UpdateMerchantBusinessInfoFailed
source: failed to update merchant business information. try again later.
fr: échec de la mise à jour des informations commerciales du commerçant. veuillez réessayer plus tard.

# UpdateMerchantContactInfoFailed
source: failed to update merchant contact information. try again later.
fr: échec de la mise à jour des informations de contact du commerçant. veuillez réessayer plus tard.

# AddContactPersonFailed
source: failed to add contact person. try again later.
fr: échec de l'ajout d'une personne de contact. veuillez réessayer plus tard.

# UpdateContactPersonFailed
source: failed to update contact person. try again later.
fr: échec de la mise à jour de la personne de contact. veuillez réessayer plus tard.

# DeleteContactPersonFailed
source: failed to delete contact person. try again later.
fr: échec de la suppression de la personne de contact. veuillez réessayer plus tard.

# GetContactPersonFailed
source: failed to retrieve contact person(s). try again later.
fr: échec de la récupération des personnes de contact. veuillez réessayer plus tard.

# UploadImageFailed
source: failed to upload image. try again later.
fr: échec du téléchargement de l'image. veuillez réessayer plus tard.

# AddBusinessDirectorOrShareholderFailed
source: failed to add director or shareholder. try again later.
fr: échec de l'ajout d'un directeur ou d'un actionnaire. veuillez réessayer plus tard.

# UpdateBusinessDirectorOrShareholderFailed
source: failed to update director or shareholder. try again later.
fr: échec de la mise à jour du directeur ou de l'actionnaire. veuillez réessayer plus tard.

# DeleteBusinessDirectorOrShareholderFailed
source: failed to delete director or shareholder. try again later.
fr: échec de la suppression du directeur ou de l'actionnaire. veuillez réessayer plus tard.

# GetAllBusinessDirectorOrShareholderFailed
source: failed to retrieve director or shareholder info. try again later.
fr: échec de la récupération des informations sur le directeur ou l'actionnaire. veuillez réessayer plus tard.

# UpdateDirectorOrShareholderImageUploadFailed
source: failed to update director or shareholder image upload. try again later.
fr: échec de la mise à jour de l'image du directeur ou de l'actionnaire. veuillez réessayer plus tard.

# UploadDocumentFailed
source: failed to upload document. try again later.
fr: échec du téléchargement du document. veuillez réessayer plus tard.

# AddBusinessDocumentFailed
source: failed to add document. try again later.
fr: échec de l'ajout du document. veuillez réessayer plus tard.

# UpdateBusinessDocumentFailed
source: failed to update document. try again later.
fr: échec de la mise à jour du document. veuillez réessayer plus tard.

# GetAllBusinessDocumentFailed
source: failed to get document(s). try again later.
fr: échec de la récupération des documents. veuillez réessayer plus tard.

# DeleteBusinessDocumentFailed
source: failed to delete document. try again later.
fr: échec de la suppression du document. veuillez réessayer plus tard.

# GetActiveRegulatorsFailed
source: failed to get active regulators. try again later.
fr: échec de la récupération des régulateurs actifs. veuillez réessayer plus tard.

# GetActiveIndustriesFailed
source: failed to get active industries. try again later.
fr: échec de la récupération des industries actives. veuillez réessayer plus tard.

source: validation error(s)
fr: erreur(s) de validation

# MerchantAlreadyExists
source: merchant already exists and onboarded
fr: le commerçant existe déjà et est intégré.
