Repository: eli-justice/jenkins-lab
Catalog: src/Egapay.Customer.Business.Gateway.Common/Resources/SuccessMessages.*.resx
Languages: fr

# GetCountriesSuccess
source: countries retrieved successfully
fr: pays récupérés avec succès.

# GetRegionsSuccess
source: regions retrieved successfully
fr: régions récupérées avec succès.

# GetBusinessInfoSuccess
source: business information retrieved successfully
fr: informations commerciales récupérées avec succès

# AddBusinessInfoSuccess
source: business information added successfully
fr: informations commerciales ajoutées avec succès

# UpdatedBusinessInfoSuccess
source: business information updated successfully
fr: informations commerciales mises à jour avec succès

# DeleteBusinessInfoSuccess
source: business information deleted successfully
fr: informations commerciales supprimées avec succès

# GetActiveRegulatorsSuccess
source: active regulators retrieved successfully
fr: régulateurs actifs récupérés avec succès

# GetActiveIndustriesSuccess
source: active industries retrieved successfully
fr: industries actives récupérées avec succès

# GetContactPersonsSuccess
source: contact persons retrieved successfully
fr: personnes de contact récupérées avec succès

# AddContactPersonSuccess
source: contact person added successfully
fr: personne de contact ajoutée avec succès

# UpdatedContactPersonSuccess
source: contact person updated successfully
fr: personne de contact mise à jour avec succès

# DeleteContactPersonSuccess
source: contact person deleted successfully
fr: personne de contact supprimée avec succès

# GetDirectorsSuccess
source: directors retrieved successfully
fr: directeurs récupérés avec succès

# AddDirectorSuccess
source: director added successfully
fr: directeur ajouté avec succès

# UpdatedDirectorSuccess
source: director updated successfully
fr: directeur mis à jour avec succès

# DeleteDirectorSuccess
source: director deleted successfully
fr: directeur supprimé avec succès

# GetDocumentsSuccess
source: documents retrieved successfully
fr: documents récupérés avec succès

# AddDocumentSuccess
source: documents added successfully
fr: documents ajoutés avec succès

# UpdatedDocumentSuccess
source: documents updated successfully
fr: documents mis à jour avec succès

# DeleteDocumentSuccess
source: documents deleted successfully
fr: documents supprimés avec succès

# GetAccountStatusSuccess
source: account status retrieved successfully
fr: statut du compte récupéré avec succès

# AddMerchantSuccess
source: merchant created successfully
fr: commerçant créé avec succès

# UpdateBusinessContactSuccess
source: business contact updated successfully
fr: contact commercial mis à jour avec succès

# GetContactInfoSuccess
source: contact information retrieved successfully
fr: informations de contact récupérées avec succès

# PasswordResetSuccess
source: password reset successfully
fr: "Mot de passe réinitialisé avec succès."

# MerchantLoginSuccess
source: merchant authenticated successfully
fr: commerçant authentifié avec succès.

# RequestPasswordResetSuccess
source: A password reset guide has been sent to your email
fr: Un guide de réinitialisation de mot de passe a été envoyé à votre e-mail

# SendOTPSuccess
source: otp sent to merchant's email
fr: otp envoyé à l'e-mail du commerçant.

# VerifyOTPSuccess
source: otp verified successfully
fr: otp vérifié avec succès
