Repository: eli-justice/jenkins-lab
Catalog: src/Egapay.Customer.Business.Gateway.Common/Resources/ValidationMessages.*.resx
Languages: fr

# EmailNotEmpty
source: email cannot be empty
fr: l'email ne peut pas être vide

# InvalidEmail
source: email must be a valid email address
fr: l'email doit être une adresse email valide

# PasswordNotEmpty
source: password cannot be empty
fr: le mot de passe ne peut pas être vide

# FirstNameNotEmpty
source: first Name cannot be empty.
fr: le prénom ne peut pas être vide

# LastNameNotEmpty
source: last name cannot be empty.
fr: le nom de famille ne peut pas être vide

# PositionNotEmpty
source: position cannot be empty.
fr: le poste ne peut pas être vide

source: position not specified
fr: le poste n'est pas spécifié

# ContactIdNotEmpty
source: contact id cannot be empty
fr: l'identifiant de contact ne peut pas être vide

# MobileNumberNotEmpty
source: mobile number cannot be empty.
fr: le numéro de mobile ne peut pas être vide

source: invalid mobile number
fr: numéro de mobile invalide

# IdentificationNumNotEmpty
source: identification number cannot be empty
fr: le numéro d'identification ne peut pas être vide

# ExpiryDateNotEmpty
source: expiry date cannot be empty
fr: la date d'expiration ne peut pas être vide

# InvalidExpiryDate
source: expiry date must be a valid date
fr: la date d'expiration doit être une date valide

# PlaceIssueNotEmpty
source: place of issue cannot be empty
fr: le lieu d'émission ne peut pas être vide

# TypeNotEmpty
source: type cannot be empty
fr: le type ne peut pas être vide

source: type not specified
fr: le type n'est pas spécifié

# FrontImageNotEmpty
source: front Image cannot be empty
fr: l'image avant ne peut pas être vide

# BackImageNotEmpty
source: back image cannot be empty
fr: l'image arrière ne peut pas être vide

# PortraitImageNotEmpty
source: portrait image cannot be empty
fr: l'image portrait ne peut pas être vide

# DocumentNotEmpty
source: document cannot be empty
fr: le document ne peut pas être vide

# DocumentSizeLimit
source: document size must be less than 1MB
fr: la taille du document doit être inférieure à 1 Mo

# DocumentInvalid
source: document must be a valid upload file
fr: le document doit être un fichier valide

# DocumentIdNotEmpty
source: documentId cannot be empty
fr: l'identifiant du document ne peut pas être vide

# MobileNumberLeast
source: mobile number must be at least 10 characters
fr: le numéro de mobile doit comporter au moins 10 caractères

# BusinessNameNotEmpty
source: business name cannot be empty.
fr: le nom de l'entreprise ne peut pas être vide

# BusinessNameLeast
source: business name must be at least 5 characters
fr: le nom de l'entreprise doit comporter au moins 5 caractères

# TradingNameNotEmpty
source: trading name cannot be empty.
fr: le nom commercial ne peut pas être vide

# TradingNameLeast
source: trading name must be at least 5 characters
fr: le nom commercial doit comporter au moins 5 caractères

# PasswordLeast
source: trading name must be at least 8 characters
fr: le mot de passe doit comporter au moins 8 caractères

# PasswordInvalid
source: password must be at least 8 characters long and may contain at least one special character
fr: le mot de passe doit comporter au moins 8 caractères et inclure au moins un caractère spécial

# OtpNotEmpty
source: otp cannot be empty
fr: le code OTP ne peut pas être vide

# OtpInvalid
source: otp is not valid
fr: le code OTP n'est pas valide

source: purpose not specified
fr: le but n'est pas spécifié

# DigitalAddressNotEmpty
source: digital address cannot be empty
fr: l'adresse numérique ne peut pas être vide

# FirstOccupancyDateNotEmpty
source: first occupancy date cannot be empty
fr: la date de première occupation ne peut pas être vide

# FirstOccupancyDateInvalid
source: first occupancy date must be a valid date
fr: la date de première occupation doit être une date valide

# OfficeOwnershipNotEmpty
source: office ownership cannot be empty
fr: la propriété du bureau ne peut pas être vide

# PostalAddressNotEmpty
source: postal address cannot be empty
fr: l'adresse postale ne peut pas être vide

# CompanyNameNotEmpty
source: company name cannot be empty
fr: le nom de l'entreprise ne peut pas être vide

# DateOfInCorporationNotEmpty
source: dateOfInCorporation cannot be empty
fr: la date d'incorporation ne peut pas être vide

# DateOfInCorporationInvalid
source: dateOfInCorporation must be a valid date.
fr: la date d'incorporation doit être une date valide

# CompanyRegistrationNoNotEmpty
source: company registration number cannot be empty
fr: le numéro d'enregistrement de l'entreprise ne peut pas être vide

# CompanyRegistrationTypeNotEmpty
source: company registration type cannot be empty
fr: le type d'enregistrement de l'entreprise ne peut pas être vide

source: company registration type not specified
fr: le type d'enregistrement de l'entreprise n'est pas spécifié

# RegulatorIdNotEmpty
source: regulator id cannot be empty
fr: l'identifiant du régulateur ne peut pas être vide

# IssueDateNotEmpty
source: issue date cannot be empty
fr: la date d'émission ne peut pas être vide

# IssueDateInvalid
source: issue date must be a valid date
fr: la date d'émission doit être une date valide

# TaxIDNumberNotEmpty
source: tax identification number cannot be empty
fr: le numéro d'identification fiscale ne peut pas être vide

# VATNumberNotEmpty
source: vat number cannot be empty
fr: le numéro de TVA ne peut pas être vide

# MerchantAlreadyExists
source: merchant already exists and onboarded
fr: le commerçant existe déjà et est intégré.
